baotrinhnz/xiaozhi-esp32/main/boards/espressif/esp-vocat/esp_vocat.cc
        bool codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
        uint8_t pcb_version = 0;
        if (codec_alive) {
            ESP_LOGI(TAG, "PCB version V1.0");
            pcb_version = 0;
        } else {
            ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 1));
            vTaskDelay(pdMS_TO_TICKS(50));
            codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
            if (codec_alive) {
                ESP_LOGI(TAG, "PCB version V1.2");
                pcb_version = 1;
                AUDIO_I2S_GPIO_DIN = AUDIO_I2S_GPIO_DIN_2;
                AUDIO_CODEC_PA_PIN = AUDIO_CODEC_PA_PIN_2;
                QSPI_PIN_NUM_LCD_RST = QSPI_PIN_NUM_LCD_RST_2;
                TOUCH_PAD2 = TOUCH_PAD2_2;
                UART1_TX = UART1_TX_2;
                UART1_RX = UART1_RX_2;
            } else {
                ESP_LOGE(TAG, "PCB version detection error");
            }
        }
        return pcb_version;
    }

    static void touch_isr_callback(void* arg) {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad != nullptr) {
            touchpad->NotifyTouchEvent();
        }
    }

    // Tải ảnh JPEG từ 1 URL -> hiện lên màn (đè mặt mèo). Trả true nếu hiện được.
    bool FetchUrlAndShow(const char* url) {
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr) return false;
        esp_http_client_config_t cfg = {};
        cfg.url = url;
        cfg.timeout_ms = 8000;
        esp_http_client_handle_t c = esp_http_client_init(&cfg);
        if (c == nullptr) return false;
        bool ok = false;
        uint8_t* buf = nullptr;
        do {
            if (esp_http_client_open(c, 0) != ESP_OK) break;
            int clen = esp_http_client_fetch_headers(c);
            if (clen <= 0 || clen > 200000) break;
            char* cnt = nullptr;
            if (esp_http_client_get_header(c, "X-Panel-Count", &cnt) == ESP_OK && cnt) {
                int v = atoi(cnt);
                if (v > 0) panel_count_ = v;
            }
            buf = (uint8_t*)malloc(clen);
            if (buf == nullptr) break;
            int off = 0, r = 0;
            while (off < clen && (r = esp_http_client_read(c, (char*)buf + off, clen - off)) > 0) {
                off += r;
            }
            if (off == clen && disp->ShowPanelImage(buf, clen)) {
                panel_active_ = true;
                ok = true;
            }
        } while (0);
        if (buf) free(buf);
        esp_http_client_close(c);
        esp_http_client_cleanup(c);
        return ok;
    }

    // Tải ảnh page thứ n từ NAS (/panel?mac=<mac mèo>&n=) -> hiện lên màn (đường VUỐT).
    void FetchAndShowPanel(int n) {
        uint8_t mac[6] = {0};
        esp_read_mac(mac, ESP_MAC_WIFI_STA);
        char url[160];
        snprintf(url, sizeof(url), "%s/panel?mac=%02x:%02x:%02x:%02x:%02x:%02x&n=%d",
                 PANEL_HOST, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], n);
        FetchUrlAndShow(url);
    }

    // Fetch+decode blocking vài giây -> KHÔNG chạy trong callback MCP (task chính); đẩy sang task riêng.
    struct PanelFetchReq { EspVocat* self; char url[200]; };
    static void PanelFetchTask(void* arg) {
        auto* rq = static_cast<PanelFetchReq*>(arg);
        rq->self->FetchUrlAndShow(rq->url);
        free(rq);
        vTaskDelete(nullptr);
    }

    // ---- Màn MEDIA native: tên (cuộn mượt) + giờ (tick trên máy). Bỏ refresh ảnh -> không tải server, không giựt audio. ----
    static void FmtTime(char* buf, size_t n, int s) {
        if (s < 0) s = 0;
        if (s < 3600) snprintf(buf, n, "%d:%02d", s / 60, s % 60);
        else snprintf(buf, n, "%d:%02d:%02d", s / 3600, (s % 3600) / 60, s % 60);
    }

    static constexpr int kBarW = 264;      // bề rộng thanh progress
    void UpdateMediaTimeLabel() {
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr || !media_active_) return;
        int pos = media_pos0_ + (int)((esp_timer_get_time() - media_t0_us_) / 1000000);
        if (media_dur_ > 0 && pos > media_dur_) pos = media_dur_;
        char a[16], b[16], line[40];
        FmtTime(a, sizeof(a), pos);
        FmtTime(b, sizeof(b), media_dur_);
        snprintf(line, sizeof(line), "%s / %s", a, b);
        int fw = (media_dur_ > 0) ? (int)((int64_t)kBarW * pos / media_dur_) : 0;
        if (fw < 2) fw = 2;
        if (fw > kBarW) fw = kBarW;
        emote_handle_t h = disp->GetEmoteHandle();
        emote_lock(h);
        if (media_time_ != nullptr) gfx_label_set_text(media_time_, line);
        if (media_bar_fg_ != nullptr) gfx_obj_set_size(media_bar_fg_, fw, 8);   // phần đã phát
        emote_unlock(h);
        emote_notify_all_refresh(h);
    }

    static void MediaTickCb(void* arg) { static_cast<EspVocat*>(arg)->UpdateMediaTimeLabel(); }

    void ShowMedia(const char* title, const char* author, int pos, int dur) {
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr) return;
        emote_handle_t h = disp->GetEmoteHandle();
        if (h == nullptr) return;
        const int bx = (360 - kBarW) / 2;                          // căn giữa thanh
        const int bar_y = 214;
        emote_lock(h);
        // Tên sách/bài (cuộn native)
        if (media_title_ == nullptr) media_title_ = emote_create_obj_by_type(h, "label", "media_title");
        if (media_title_ != nullptr) {
            gfx_label_set_font(media_title_, (void*)&vocat_vn_26);
            gfx_label_set_color(media_title_, GFX_COLOR_HEX(0xF5F5F5));
            gfx_obj_set_size(media_title_, 300, 40);
            gfx_label_set_scroll_speed(media_title_, 50);
            gfx_label_set_text(media_title_, title ? title : "");
            gfx_label_set_long_mode(media_title_, GFX_LABEL_LONG_SCROLL);
            gfx_obj_align(media_title_, GFX_ALIGN_CENTER, 0, -46);
            gfx_obj_set_visible(media_title_, true);
        }
        // Tác giả / ca sĩ
        if (media_author_ == nullptr) media_author_ = emote_create_obj_by_type(h, "label", "media_author");
        if (media_author_ != nullptr) {
            bool has = (author != nullptr && author[0] != '\0');
            gfx_label_set_font(media_author_, (void*)&vocat_vn_26);
            gfx_label_set_color(media_author_, GFX_COLOR_HEX(0x9FC8C0));
            gfx_label_set_text(media_author_, has ? author : " ");
            gfx_obj_align(media_author_, GFX_ALIGN_CENTER, 0, -8);
            gfx_obj_set_visible(media_author_, has);
        }
        // Thanh progress: nền (track) + phần đã phát — dùng label BẬT NỀN làm hình chữ nhật
        if (media_bar_bg_ == nullptr) media_bar_bg_ = emote_create_obj_by_type(h, "label", "media_bar_bg");
        if (media_bar_bg_ != nullptr) {
            gfx_label_set_text(media_bar_bg_, " ");
            gfx_label_set_bg_enable(media_bar_bg_, true);
            gfx_label_set_bg_color(media_bar_bg_, GFX_COLOR_HEX(0x2A4A3C));
            gfx_obj_set_size(media_bar_bg_, kBarW, 8);
            gfx_obj_set_pos(media_bar_bg_, bx, bar_y);
            gfx_obj_set_visible(media_bar_bg_, true);
        }
        if (media_bar_fg_ == nullptr) media_bar_fg_ = emote_create_obj_by_type(h, "label", "media_bar_fg");
        if (media_bar_fg_ != nullptr) {
            gfx_label_set_text(media_bar_fg_, " ");
            gfx_label_set_bg_enable(media_bar_fg_, true);
            gfx_label_set_bg_color(media_bar_fg_, GFX_COLOR_HEX(0x7FD1C4));
            gfx_obj_set_size(media_bar_fg_, 2, 8);
            gfx_obj_set_pos(media_bar_fg_, bx, bar_y);
            gfx_obj_set_visible(media_bar_fg_, true);
        }
        // Giờ (set size + text + căn giữa rõ ràng để chắc hiện)
        if (media_time_ == nullptr) media_time_ = emote_create_obj_by_type(h, "label", "media_time");
        if (media_time_ != nullptr) {
            char a0[16], b0[16], line0[40];
            FmtTime(a0, sizeof(a0), pos);
            FmtTime(b0, sizeof(b0), dur);
            snprintf(line0, sizeof(line0), "%s / %s", a0, b0);
            gfx_label_set_font(media_time_, (void*)&vocat_vn_26);
            gfx_label_set_color(media_time_, GFX_COLOR_HEX(0x9FC8C0));
            gfx_obj_set_size(media_time_, 240, 34);
            gfx_label_set_text(media_time_, line0);
            gfx_label_set_text_align(media_time_, GFX_TEXT_ALIGN_CENTER);
            gfx_obj_align(media_time_, GFX_ALIGN_CENTER, 0, 78);
            gfx_obj_set_visible(media_time_, true);
        }
        emote_set_anim_visible(h, false);                          // ẩn mặt mèo
        emote_unlock(h);
        emote_notify_all_refresh(h);
        media_pos0_ = pos; media_dur_ = dur; media_t0_us_ = esp_timer_get_time(); media_active_ = true;
        UpdateMediaTimeLabel();
        if (media_timer_ == nullptr) {
            esp_timer_create_args_t a = {};
            a.callback = MediaTickCb; a.arg = this; a.name = "media_tick";
            esp_timer_create(&a, &media_timer_);
        }
        esp_timer_stop(media_timer_);
        esp_timer_start_periodic(media_timer_, 1000000);           // tick mỗi 1s (giờ nhảy trên máy)
    }

    void HideMedia() {
        if (!media_active_) return;
        media_active_ = false;
        if (media_timer_ != nullptr) esp_timer_stop(media_timer_);
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr) return;
        emote_handle_t h = disp->GetEmoteHandle();
        emote_lock(h);
        if (media_title_ != nullptr) gfx_obj_set_visible(media_title_, false);
        if (media_author_ != nullptr) gfx_obj_set_visible(media_author_, false);
        if (media_time_ != nullptr) gfx_obj_set_visible(media_time_, false);
        if (media_bar_bg_ != nullptr) gfx_obj_set_visible(media_bar_bg_, false);
        if (media_bar_fg_ != nullptr) gfx_obj_set_visible(media_bar_fg_, false);
        emote_set_anim_visible(h, true);                           // trả mặt mèo
        emote_unlock(h);
        emote_notify_all_refresh(h);
    }

    // Đăng ký tool MCP: brain (khi user "Mèo cho xem lịch") gọi -> hiện panel của người chỉ định.
    void InitializeTools() {
        auto& mcp = McpServer::GetInstance();
        mcp.AddTool(
            "self.screen.show_panel",
            "Hiển thị trang thông tin của một người lên màn hình. Tham số person = tên người "
            "(vd Ja, Men), view = loại trang (calendar/weather/clock).",
            PropertyList({
                Property("person", kPropertyTypeString),
                Property("view", kPropertyTypeString, std::string("calendar")),
            }),
            [this](const PropertyList& properties) -> ReturnValue {
                std::string person = properties["person"].value<std::string>();
                std::string view = properties["view"].value<std::string>();
                auto* rq = static_cast<PanelFetchReq*>(malloc(sizeof(PanelFetchReq)));
                if (rq == nullptr) return false;
                rq->self = this;
                snprintf(rq->url, sizeof(rq->url), "%s/panel?person=%s&view=%s",
                         PANEL_HOST, person.c_str(), view.c_str());
                xTaskCreatePinnedToCore(PanelFetchTask, "panel_fetch", 4 * 1024, rq, 5, nullptr, 0);
                return true;
            });
        // Đóng panel -> trả màn về mặt mèo. Brain gọi khi DỪNG phát nhạc/sách (server show_panel không tự tắt).
        mcp.AddTool(
            "self.screen.hide_panel",
            "Đóng panel đang hiện trên màn hình, trả về mặt mèo. Gọi khi dừng phát nhạc/sách "
            "hoặc khi không cần hiển thị panel nữa.",
            PropertyList(),
            [this](const PropertyList&) -> ReturnValue {
                auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
                if (disp != nullptr) disp->HidePanel();
                HideMedia();                                   // đóng cả màn media native (nếu đang hiện)
                panel_active_ = false;
                return true;
            });
        // Màn "đang phát" NATIVE (tên cuộn + giờ tick trên máy) — thay panel-ảnh cho audiobook/nhạc, khỏi refresh ảnh.
        mcp.AddTool(
            "self.screen.media_show",
            "Hiển thị màn đang phát NATIVE: tên bài/sách (chữ tự cuộn ngang) + thời gian (tự nhảy trên máy). "
            "Gọi 1 lần khi bắt đầu phát nhạc/sách nói. title=tên, pos=số giây đã phát, dur=tổng số giây.",
            PropertyList({
                Property("title", kPropertyTypeString, std::string("")),
                Property("author", kPropertyTypeString, std::string("")),
                Property("pos", kPropertyTypeInteger, 0),
                Property("dur", kPropertyTypeInteger, 0),
            }),
            [this](const PropertyList& properties) -> ReturnValue {
                std::string title = properties["title"].value<std::string>();
                std::string author = properties["author"].value<std::string>();
                int pos = properties["pos"].value<int>();
                int dur = properties["dur"].value<int>();
                ShowMedia(title.c_str(), author.c_str(), pos, dur);
                return true;
            });
    }

    void OnTouchStart(int x, int y) {
        touch_t0_ = (uint32_t)(esp_timer_get_time() / 1000);
        touch_sx_ = touch_lx_ = x;
        touch_sy_ = touch_ly_ = y;
    }

    void OnTouchMove(int x, int y) { touch_lx_ = x; touch_ly_ = y; }

    void OnTouchEnd() {
        int dx = touch_lx_ - touch_sx_, dy = touch_ly_ - touch_sy_;
        const int SW = 45;                                  // ngưỡng vuốt (px)
        auto& app = Application::GetInstance();
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (abs(dx) >= SW && abs(dx) >= abs(dy)) {          // vuốt NGANG -> vào/đổi page
            if (!panel_active_) panel_n_ = 0;
            else panel_n_ += (dx < 0 ? 1 : -1);             // vuốt trái = trang kế, phải = trang trước
            FetchAndShowPanel(panel_n_);
        } else if (dy <= -SW && abs(dy) > abs(dx)) {        // vuốt LÊN -> thoát panel
            if (panel_active_ && disp) { disp->HidePanel(); panel_active_ = false; }
        } else {                                            // CHẠM (di chuyển nhỏ)
            if (panel_active_ && disp) {                    // đang xem panel -> chạm để thoát
                disp->HidePanel(); panel_active_ = false;
            } else if (app.GetDeviceState() == kDeviceStateStarting) {
                EnterWifiConfigMode();
            } else {
                app.ToggleChatState();                      // chạm thường = nói chuyện (như cũ)
            }
        }
    }

    static void touch_event_task(void* arg) {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad == nullptr) {
            ESP_LOGE(TAG, "Invalid touchpad pointer in touch_event_task");
            vTaskDelete(NULL);
            return;
        }

        while (true) {
            if (touchpad->WaitForTouchEvent()) {
                auto& board = (EspVocat&)Board::GetInstance();

